var gamesData = [
  {
    name: "Alone in the dark",
    youtubeLink: "https://www.youtube.com/embed/FuvCx55RNYI",
    description: "Угрюмый Остров веками скрывал свои мрачные тайны. Настал роковой момент, когда зловещие обитатели проклятого клочка суши решили поделиться сокровенным… Специальный агент ФБР и доктор антропологии летели сюда вместе, но прибыли порознь. Каждый из героев безнадежно одинок в окружающей тьме… Тьме собственных взаимоотношений и своего прошлого, тьме, приютившей невыносимо уродливых тварей. Эталон жанра ужасов, навеянный творчеством великого Говарда Ф. Лавкрафта, заставит игрока пережить, возможно, самые страшные часы земной жизни"
  },
  {
    name: "Resident evil 3",
    youtubeLink: "https://www.youtube.com/embed/9sLFQwRbSAg",
    description: "Сюжет игры начинает свое повествование за сутки до событий Resident Evil 2. Под нашим контролем снова Джилл Валентайн - героиня первой части игры. Она не успела покинуть город из-за введенного карантина, в то время как остальные выжившие члены отряда S.T.A.R.S. уехали в Европу. Раккун всё больше и больше впадал в хаос. Джилл собрала вещи, взяла пистолет и вышла на улицу, чтобы начать свой последний побег. Побег из обречённого корпорацией Амбрелла города. На этот раз вы не ограничены одним зданием, теперь поле боя - целые кварталы, а новый опасный враг - Немезис, не даст вам скучать ни минуты."
  },
  {
    name: "Silent Hill",
    youtubeLink: "https://www.youtube.com/embed/GrVQqhjFSgw",
    description: "https://www.youtube.com/embed/u1nY_5-UrY4"
  }
  ,
  {
    name: "Amnesia",
    youtubeLink: "https://www.youtube.com/embed/u1nY_5-UrY4",
    description: "Остатки памяти исчезают в темноте. Твой разум в смятении, и ты не в силах освободиться от навязчивого чувства преследования. Нужно найти выход. Проснуться... Ты, спотыкаясь, идешь по узкому коридору и слышишь плач вдалеке. Звук приближается. Нужно выяснить... Это действительно кто-то шаркает ногами? Или это просто игра твоего больного воображения? Ощущения... Что-то появляется из темноты. Оно приближается. Быстро. Выжить..."
  }
  ,
  {
    name: "Alien Isolation",
    youtubeLink: "https://www.youtube.com/embed/7h0cgmvIrZw",
    description: "Действие триллера Alien: Isolation разворачивается спустя пятнадцать лет после событий оригинальной кинокартины Ридли Скотта «Чужой». И теперь уже дочери Эллен Рипли, Аманде, предстоит столкнуться с ужасом из космических глубин в попытке выяснить всю правду об исчезновении матери. В роли Аманды вы повстречаетесь с ослепленными паникой, доведенными до крайней степени отчаяния людьми и непредсказуемым безжалостным ксеноморфом – Чужим… Аманда не обладает выдающейся силой и не имеет специальной подготовки. А значит, ей с вашей помощью предстоит проявить находчивость в, казалось бы, безвыходном положении, научиться быстро принимать решения перед лицом смертельной опасности и в полной мере воспользоваться своим единственным преимуществом – разумом. Только так получится выжить.",
  }
  ,
  {
    name: "Dead Space",
    youtubeLink: "https://www.youtube.com/embed/QmNEXtaEc9Q",
    description: "В живых останутся только мертвые... После того, как огромный космический корабль-добытчик руды натыкается на далекой планете на странный артефакт, связь с ним обрывается. Инженер Айзек Кларк отправляется устранить поломку, но прибыв на место, обнаруживает следы кошмарной кровавой резни — команда корабля вырезана и заражена инопланетной болезнью. Айзек отрезан от окружающего мира, заперт на корабле и вынужден отчаянно сражаться за жизнь."
  }
  ,
  {
    name: "Vampires Countdown",
    youtubeLink: "https://www.youtube.com/embed/lTCVeH4pIoM",
    description: "Частный детектив Кит был приглашен на вечеринку для высокопоставленных персон. Всем казалось, что организаторы придумали грандиозное шоу с огнем и кровью. Когда же гости поняли, что вода, хлынувшая из кранов пожарной охраны, несет в себе вирус, превращающий людей в вампиров, они бросились к выходу. Герой остался один на один с армией живых мертвецов. Разобраться в загадке выплеснувшего кошмара и предотвратить катастрофу может теперь только он."
  }
  ,
  {
    name: "Dino Crisis 2",
    youtubeLink: "https://www.youtube.com/embed/DI_U_w2THWI",
    description: "Группа спецназа высаживается на небольшом тропическом острове Айбис с задачей найти и доставить доктора Кирка, талантливейшего ученого в области физики высоких энергий. Однако в результате его экспериментов с т. н. «третьей энергией» произошёл сдвиг во времени, в результате которого на остров проникли древние ящеры — динозавры. Таким образом вполне заурядное задание плавно переходит в битву за выживание",
  }
  ,
  {
    name: "Alien Resurrection",
    youtubeLink: "https://www.youtube.com/embed/7xjmyZe7f_Q",
    description: "В роли лейтенанта Элен Рипли мы снова будем играть в прятки с самыми, пожалуй, страшными монстрами за всю историю киноиндустрии. Управление получилось не очень удачным, но игру спасла превосходная по тем временам графика, неплохая атмосферность, (в которой действительно временами становилось жутковато) и приличный дизайн уровней. В общем, хорошая игра, позволяющая насладится инопланетным мясом сполна.",
  }


]

let temp = "";
$(".btn-primary").on("click", function () {
  temp = $(this).siblings(".card-title");
  console.log($(this).siblings(".card-title"))
  console.log(temp.eq(0).innerHTML)
  temp = this.parentNode.firstElementChild.innerHTML;
  console.log(temp)
  for (let i = 0; i < gamesData.length; i++) {
    if (temp.toLowerCase() == gamesData[i].name.toLowerCase()) {
      document.querySelector(".some-class").src = gamesData[i].youtubeLink
    }
  }
})
